IdeaRS.OpenModel.Loading.TypeDuration
Duration of load case

IdeaRS.OpenModel.Loading.TypeDuration.LongTerm
Long term

IdeaRS.OpenModel.Loading.TypeDuration.MediumTerm
Medium term

IdeaRS.OpenModel.Loading.TypeDuration.ShortTerm
Short term

IdeaRS.OpenModel.Loading.TypeDuration.InstantaneousTerm
Instantaneous term